package balaboba

// Warn1 is a first warning for working with it.
const Warn1 = `Нейросеть не знает, что говорит, и может сказать всякое — если что, не обижайтесь.
Распространяя получившиеся тексты, помните об ответственности. (18+)`

// Warn2 is a second warning for working with it.
const Warn2 = `Генератор может выдавать очень странные тексты.
Пожалуйста, будьте разумны, распространяя их.
Подумайте, не будет ли текст обидным для кого-то и не станет ли его публикация нарушением закона.`

// About Balaboba.
const About = `Балабоба демонстрирует, как с помощью нейросетей семейства YaLM можно продолжать тексты на любую тему, сохраняя связность и заданный стиль.
Здесь эти нейросети используются для развлечения, но разрабатывались они для серьёзных задач — об этом можно почитать тут.

У Балабобы нет своего мнения или знания.
Он умеет только подражать — писать тексты так, чтобы они были максимально похожи на реальные тексты из интернета.`

// BadQuery ...
const BadQuery = `Балабоба не принимает запросы на острые темы, например, про политику или религию.
Люди могут слишком серьёзно отнестись к сгенерированным текстам.

Вероятность того, что запрос задаёт одну из острых тем, определяет нейросеть, обученная на оценках случайных людей.
Но она может перестараться или, наоборот, что-то пропустить.`
